app/controllers/assigns_controller.rb

	def new
		@user = User.find(params[:id])
		@student_role = User.where(role: 'Student')
		@instructor_role =User.where(role: 'Instructor')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "Student"]]

    def edit
    	@user = User.find(params[:id])
        @student = Student.find_by(user_id: params[:id])
        @instructor = Instructor.find_by(user_id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]