app/controllers/cohorts_controller.rb

	def index
		@cohort = Cohort.all
---
SELECT "cohorts".* FROM "cohorts"

	def  show
		@cohort = Cohort.find(params[:id])
---
SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@cohort = Cohort.create(cohort_params)
---
INSERT INTO "cohorts" ("name", "start", "end", "course_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "AI-Holmes-FALL18"], ["start", "2018-09-10"], ["end", "2019-01-15"], ["course_id", 2]]

    def edit
        @cohort = Cohort.find(params[:id])
---
SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        @cohort = Cohort.find(params[:id])
        @cohort.update(cohort_params)
---
SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cohorts" SET "start" = $1 WHERE "cohorts"."id" = $2  [["start", "2018-01-20"], ["id", 2]]

    def destroy
        Course.find(params[:id]).destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]