app/controllers/courses_controller.rb

	def index
		puts "i am in path /courses"
		@course = Course.all
---
SELECT "courses".* FROM "courses"

	def  show
		puts "I am in /courses/id route"
		@course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

	def create
		@course = Course.create(course_params)
---
INSERT INTO "courses" ("name", "total_hrs") VALUES ($1, $2) RETURNING "id"  [["name", "Android Dev"], ["total_hrs", 640]]

    def update
        @course = Course.find(params[:id])
        @course.update(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "courses" SET "name" = $1, "total_hrs" = $2 WHERE "courses"."id" = $3  [["name", "IOS Dev"], ["total_hrs", 640], ["id", 3]]