app/controllers/students_controller.rb

	def index
		puts "i am in path /students"
		@student = User.where(role: 'Student')
		@user_stud = Student.all
---
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "Student"]]
SELECT "students".* FROM "students"

	def create
		@student = Student.create(student_params)
---
INSERT INTO "students" ("user_id", "cohort_id", "grade") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 7], ["cohort_id", 1], ["grade", "NG"]]

    def edit
        @student = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]